[{"title":"MPLS","introtext":"EZECOM's MPLS (Multi Protocol Label Switching) services are highly scalable, protocol agnostic, data-carrying mechanisms that will ensure that your large corporation makes the most of their IT-network. EZECOM is the first ISP to bring this international standard service to Cambodia. Our experienced technical team ensures that your company has the best available in house.\r\n \r\nThe main benefits of using EZECOM MPLS services are:\r\n\r\nIncreased resilience\r\nImproved data management\r\nMulti-service and traffic management capabilities\r\nMaximize Network Utilization\r\nCost reduction through data network convergence\r\nEnables \"triple play\" on common backbone\r\nSupports Multi Cities\r\n\r\nPlease contact our sales team for a free assessment of your needs. After our assessment we will create a tailor made offer without engagement for you.","fulltext":"","created":"2013-09-17 02:55:28","modified":"2013-08-14 09:53:07","parentid":0,"imagelink":""},{"title":"EZECOM DEDICATED PACKAGES","introtext":"EZECOM Dedicated Packages are designed to support business critical functions and offer high speed connectivity and reliable access.\r\n \r\nEZECOM Dedicated Packages allow you to send and receive large amount of data, conduct video conferences, run web based applications, stream video and any mission critical applications.\r\n \r\nEZECOM dedicated packages give you the highest level of performance delivered over our highly dependable and redundant infrastructure with 24-hour network monitoring and customer support included.\r\n \r\nPlease contact us today for more information.\r\n \r\n \r\n \r\n \r\n \r\n ","fulltext":"","created":"2013-09-17 02:55:28","modified":"2013-11-22 09:07:45","parentid":0,"imagelink":""},{"title":"ibizCloud","introtext":"EZECOM’s ibizCloud, off-site data storage and management system for your business, meets the strictest international security standards. An alternative to on-site data storage, EZECOM’s ibizCloud offer cost efficient, flexible solutions for a company with growing data-needs. EZECOM is the first ISP to bring this international standard service to Cambodia.\n \nOur experienced technical team is contactable 24\/7 and will compliment this high quality product with the best of local support.\n \nThe main benefits of using the EZECOM IbizCloud are:\n\nFast provisioning: Get your project setup instantly\nScalability: Our ibizCloud enables businesses of all sizes\nFinancial advantage: Maximize your ROI by converting CapEx to OpEx\nRich connectivity: Deliver content closer to your customers or users domestically and Internationally via ibizCloud global network of partners.\nReliable: Let us take care of the hardware so you can enjoy peace-of-mind\nLocal provider: Partner with us = get local support\n\nPlease contact our sales team for a free assessment of your needs. After our assessment we will create a tailor made offer without engagement for you.","fulltext":"","created":"2015-02-02 06:47:46","modified":"2015-02-02 08:59:23","parentid":0,"imagelink":""}]